import CardsWrapper from "../cards-wrapper/cards-wrapper";
import {
  art1530,
  art180,
  art4530,
  art480,
  art790,
  standardAJKL,
  standardAkl,
  standardCe,
  standardEac,
  standardEn4342,
  standardEn4441,
  standardEn511,
  standardI,
} from "../../constants/constants";
import "./assortiment.scss";

export const cardsNitril = [
  {
    img: art4530,
    alt: "Перчатки с нитриловым покрытием арт. 4530",
    title: "Перчатки с нитриловым покрытием арт. 4530",
    article: " 4530",
    text:
      "Модель с укороченной твердой крагой Основа джерси из 100% хлопка обеспечивает рукам традиционно высокий уровень комфорта и абсорбирования влаги. Усиленное акрилонитрилбутадиеновое покрытие обеспечивает повышенную стойкость к тяжелым механическим нагрузкам. Полный облив дополнительно защищает от агрессивных жидкостей в зоне покрытия. Анатомическая форма перчатки снижает усталость рук Для предотвращения возникновения микробной среды и устранения неприятных запахов после производственного процесса перчатка прошла антибактериальную обработку.",
    size: " 11",
    lgth: " 270-290 мм",
    safety: " Ми Мп Нс Нм Нт Вн К80 Щ50",
    weight: " 135,00 гр",
    certificate:
      "ТР ТС 019/2011, ГОСТ 12.4.252-2013, EN 388:2003, ГОСТ Р ЕН 1149-5:2008",
    standardsImg: [
      standardEn4441,
      standardAkl,
      standardEac,
      standardI,
      standardCe,
    ],
  },
  {
    img: art1530,
    alt: "Перчатки с нитриловым покрытием арт. 1530",
    title: "Перчатки с нитриловым покрытием арт. 1530",
    article: " 1530",
    text:
      "Модель с трикотажной манжетой Основа джерси из 100% хлопка обеспечивает рукам традиционно высокий уровень комфорта и абсорбирования влаги. Усиленное акрилонитрилбутадиеновое покрытие обеспечивает повышенную стойкость к тяжелым механическим нагрузкам. Полный облив дополнительно защищает от агрессивных жидкостей в зоне покрытия. Анатомическая форма перчатки снижает усталость рук Для предотвращения возникновения микробной среды и устранения неприятных запахов после производственного процесса перчатка прошла антибактериальную обработку.",
    size: " 11",
    lgth: " 270-290 мм",
    safety: " Ми Мп Нс Нм Нт Вн К80 Щ50",
    weight: " 130,00 гр",
    certificate:
      "ТР ТС 019/2011, ГОСТ 12.4.252-2013, EN 388:2003, ГОСТ Р ЕН 1149-5:2008",
    standardsImg: [
      standardEn4441,
      standardAkl,
      standardEac,
      standardI,
      standardCe,
    ],
  },
];
export const cardsInsulated = [
  {
    img: art180,
    alt: "Перчатки утепленные с ПВХ покрытием арт. 180",
    title: "Перчатки утепленные с ПВХ покрытием арт. 180",
    article: " 180",
    text:
      "Модель с трикотажной манжетой Материал основы 100% хлопок «джерси». Перчатки для защиты рук от механических воздействий, пониженных температур (до -60 С), воздействий нефти и нефтепродуктов. Антистатические. Морозостойкое ПВХ покрытие, стойкие к воздействию масел, жиров и химических веществ. Сигнальный оранжевый цвет обеспечивает Внутренняя антибактериальная обработка.",
    lining: " пенополиуретан",
    material: " морозостойкий ПВХ",
    size: " 11",
    safety: " Ми Мп Нм Нс Нм Нт Вн Тн К80 Щ50",
    certificate:
      "ТР ТС 019/2011, ГОСТ 12.4.252-2013, EN 388:2003-4342, EN 511:2012-221, ГОСТ Р ЕН 1149-5:2008",
    standardsImg: [
      standardEn4342,
      standardEn511,
      standardAJKL,
      standardEac,
      standardI,
      standardCe,
    ],
  },
  {
    img: art480,
    alt: "Перчатки утепленные с ПВХ покрытием арт. 480",
    title: "Перчатки утепленные с ПВХ покрытием арт. 480",
    article: " 480",
    text:
      "Перчатки для защиты рук от механических воздействий, пониженных температур (до -60 С), воздействий нефти и нефтепродуктов. Антистатические. Морозостойкое ПВХ покрытие, стойкие к воздействию масел, жиров и химических веществ. Сигнальный оранжевый цвет обеспечивает дополнительную безопасность во время работы. Внутренняя антибактериальная обработка.",
    lining: " пенополиуретан",
    material: " морозостойкий ПВХ",
    size: " 11",
    safety: "  Ми Мп Нм Нс Нм Нт Вн Тн К80 Щ50",
    certificate:
      "ТР ТС 019/2011, ГОСТ 12.4.252-2013, EN 388:2003-4342, EN 511:2012-221, ГОСТ Р ЕН 1149-5:2008",
    standardsImg: [
      standardEn4342,
      standardEn511,
      standardAJKL,
      standardEac,
      standardI,
      standardCe,
    ],
  },
  {
    img: art790,
    alt: "Перчатки утепленные с ПВХ покрытием арт. 790",
    title: "Перчатки утепленные с ПВХ покрытием арт. 790",
    article: " 790",
    text:
      "Перчатки для защиты рук от механических воздействий, пониженных температур (до -60 С), воздействий нефти и нефтепродуктов. Антистатические. Морозостойкое ПВХ покрытие, стойкие к воздействию масел, жиров и химических веществ. Сигнальный оранжевый цвет обеспечивает дополнительную безопасность во время работы. Внутренняя антибактериальная обработка.",
    lining: " пенополиуретан",
    material: " морозостойкий ПВХ",
    size: " 11",
    safety: " Ми Мп Нм Нс Нм Нт Вн Тн К80 Щ50",
    certificate:
      "ТР ТС 019/2011, ГОСТ 12.4.252-2013, EN 388:2003-4342, EN 511:2012-221, ГОСТ Р ЕН 1149-5:2008",
    standardsImg: [
      standardEn4342,
      standardEn511,
      standardAJKL,
      standardEac,
      standardI,
      standardCe,
    ],
  },
];

function Assortment() {
  return (
    <section className="assortment" id="assort">
      <h2 className="assortment__title-wrapper">Ассортимент</h2>
      <h3 className="assortment__title">Перчатки нитриловые</h3>
      <CardsWrapper cards={cardsNitril} />
      <h3 className="assortment__title">Перчатки утеплённые ПВХ</h3>
      <CardsWrapper cards={cardsInsulated} />
      <p className="assortment__notice">
        *оставьте заявку в форме обратной связи и получите оптовый прайс-лист
      </p>
    </section>
  );
}

export default Assortment;
